Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/checklists/checklist_entitlements_and_services_for_self-employed_people.html.txt.tmx
Source language: en
Languages: ga

source: Checklist: information for self-employed people
ga: Seicliosta: faisnéis do dhaoine féinfhostaithe

source: If you are self-employed and have had a downturn in business and a reduction in your income you can use the links and lists below to check out your entitlements
ga: Má tá tú féinfhostaithe agus má tháinig laghdú ar an ngnó agus ar d’ioncam, féadfaidh tú na naisc agus na liostaí thíos a úsáid chun do chuid teidlíochtaí a sheiceáil

source: document.write("If you would like these links to remain available while you browse this website, you can 'pin' the checklist to the right-hand side of the website
ga: document.write("Más mian leat go bhfanfadh na nascanna seo ar fáil fad is atá an suíomh seo á bhrabhsáil agat, d’fhéadfá an seicliosta a ‘ghreamadh’ ar thaobh deis an tsuímh

source: It will remain in place until you click the 'X' in the top right-hand corner.");
ga: Fanfaidh an seicliosta ansin go dtí go chliceáltar an ‘X’ sa chúinne ag barr an taoibh dheis.");

source: The headings in the left hand column of each section link to general documents on the subject, and those in the right hand column link to details of specific payments or services
ga: Tá naisc sna teidil sa cholún ar chlé i ngach mír le doiciméid ghinearálta faoin ábhar, agus tá naisc sa cholún ar dheis le sonraí faoi íocaíochtaí nó faoi sheirbhísí sonracha

source: Setting up a business
ga: Gnó a chur ar bun

source: │ │ Becoming self-employed and Setting up a business give you a broad overview of the factors involved in setting up a business, including information on types of self-employment, tax, PRSI, legal issues and sources of support
ga: │ │ Tugann Chun bheith féinfhostaithe agus Gnó a chur ar bun léargas fairsing duit ar na tosca a bhíonn i gceist agus gnó á chur ar bun, lena n-áirítear faisnéis ar na saghsanna fostaíochta, cáin, ÁSPC, saincheisteanna dlí agus foinsí tacaíochta

source: │ │ Back to Work Enterprise Allowance │
ga: │ │ Liúntas Fiontraíocht um Fhilleadh ar Obair │

source: │ Supports for unemployed people │ │
ga: │ Tacaíochtaí do dhaoine dífhostaithe │ │

source: │ │ Short-term Enterprise Allowance │
ga: │ │ Liúntas Fiontraíochta Gearrthéarmach │

source: │ │ If you are no longer earning enough from self-employment, or your business has to close down, you may qualify for a social welfare payment
ga: │ │ Mura bhfuil dóthain á thuilleamh agat a thuilleadh ó fhéinfhostaíocht, nó má tá ar do ghnólacht dúnadh, féadfaidh tú cáiliú le haghaidh íocaíocht leasa shóisialaigh

source: You do not need to deregister as self-employed to get a payment
ga: Ní gá duit díchlárú de bheith féinfhostaithe chun íocaíocht a fháil

source: │ │ Jobseeker's Benefit (for people with sufficient PRSI contributions) │
ga: │ │ Sochar Cuardaitheora Poist (do dhaoine ag a bhfuil ranníocaíochtaí leordhóthanacha ÁSPC) │

source: │ Getting a social welfare payment │ Claiming for an adult dependant │
ga: │ Íocaíocht leasa shóisialaigh a fháil │ Ag éileamh do chleithiúnaí aosaigh │

source: │ │ Claiming for a child dependant │
ga: │ │ Ag éileamh do chleithiúnaí linbh │

source: │ │ Signing on for the first time │
ga: │ │ Síniú den chéad uair │

source: │ Supplementary Welfare Allowance Scheme │ Exceptional Needs and Urgent Needs Payments │
ga: │ An Scéim Liúntais Leasa Fhorlíontaigh │ Íocaíochtaí ar Riachtanais Eisceachtúla agus Phráinneacha │

source: │ │ Becoming a voluntary contributor │
ga: │ │ Bheith i do ranníocóir deonach │

source: │ Maintaining your social insurance record │ │
ga: │ Do thaifead árachais shóisialta a choimeád │ │

source: │ │ Signing on for credits (in some cases self-employed people may be able to sign for credited PRSI contributions) │
ga: │ │ Síniú le haghaidh creidmheasanna (i roinnt cásanna, d’fhéadfadh go mbeadh daoine féinfhostaithe in ann síniú le haghaidh creidmheasanó ranníocaíochtaí ÁSPC) │

source: │ │ Smallbusinessfinance.ie is a website for small businesses looking for information about financing or funding their business
ga: │ │ Tá smallbusinessfinance.ie dírithe ar ghnólachtaí beaga agus tá faisnéis faoina ngnólacht a mhaoiniú nó a chistiú á lorg acu

source: │ Getting credit │ │
ga: │ Creidmheas a fháil │ │

source: │ │ If you have a small or medium business and your application for credit is refused you may be able to apply to the Credit Review Office to have your case reviewed
ga: │ │ Má tá agat gnólacht beag nó meánach agus má dhiúltaítear d'iarratas ar chreidmheas, d’fhéadfadh go mbeifeá in ann iarratas a dhéanamh chuig an Oifig um Athbhreithniú Creidmheasa d'fhonn go ndéanfar athbhreithniú ar do chás

source: Am I really self-employed?
ga: An bhfuilim féinfhostaithe i ndáiríre?

source: │ │ Code of Practice for determining Employment or Self- Employment status of Individuals (pdf) │
ga: │ │ Cód Cleachtais chun stádas Fostaíochta nó Féinfhostaíochta Daoine a dheimhniú (pdf) │

source: Going back to education or getting back to work
ga: Ag filleadh ar oideachas nó ar obair

source: │ │ Back to Education Programme │
ga: │ │ Clár um Fhilleadh ar Oideachas │

source: │ Education and training │ Back to Education Allowance │
ga: │ Oideachas agus Oiliúint │ Liúntas um Fhilleadh ar Oideachas │

source: │ │ Vocational Training Opportunities Scheme │
ga: │ │ An Scéim Deiseanna Oiliúna Gairmoideachais │

source: │ │ There are a number of schemes to support people who are unemployed and want to get back to work
ga: │ │ Is ann do líon scéimeanna le tacú le daoine atá dífhostaithe agus ar mian leo filleadh ar obair
